## ETL-DataSet-2018/11/17

##### The objective of this project was to Extract, Transform, and Load data into a newly created database. The data sets were found online. The objective was to create a database with these data sets. First, the data sets were exracted from Kaggle. Second, the data sets were transformed by dropping what was unimportant columns. The final step was to load the transformed data sets into MySQL for further manipulation.

### Importing Dependencies

In [1]:
import pandas as pd
from sqlalchemy import create_engine

## 1- Exctracting CSVs into DataFrames

In [2]:
dataSet1_file = "Resources/dataSet1.csv"
dataSet1_df = pd.read_csv(dataSet1_file)
dataSet1_df.head()

   ID First Name Last Name Gender Does Ski Preffered Ski Resort Buys Ski Pass
0   1       Todd     Lopez      M       no            Telluride            no
1   2     Joshua     White      M      yes         Breckenridge            no
2   3       Mary     Lewis      F      yes             Keystone           yes
3   4      Emily     Burns      F       no              A-Basin            no
4   5  Christina    Romero      F      yes                Aspen            no

In [3]:
dataSet2_file = "Resources/dataSet2.csv"
dataSet2_df = pd.read_csv(dataSet2_file)
dataSet2_df.head()

,ID,User ID,First Name,Last Name,Marital Status,Has Kids,Occupation,Annual Income,Ethnicity
0,1,1,Todd,Lopez,married,no,student,251061,african_american
1,2,2,Joshua,White,single,no,employed,217323,asian
2,3,3,Mary,Lewis,divorced,no,employed,211496,other
3,4,4,Emily,Burns,married,no,employed,77843,african_american
4,5,5,Christina,Romero,married,no,NaN,0,native_american

## 2- Transforming Data

#### Transforming dataSet1 into a DataFrame

In [4]:
# Create a filtered dataframe from specific columns
dataSet1_cols = ['ID','First Name', 'Last Name', 'Gender']
dataSet1_transformed = dataSet1_df[dataSet1_cols].copy()

# Rename the column headers
dataSet1_transformed = dataSet1_transformed.rename(columns={"First Name": "first_name",
                                                          "Last Name": "last_name",
                                                          "Gender": "gender"})

# Clean the data by dropping duplicates and setting the index
# dataSet1_transformed.drop_duplicates("ID", inplace=True)



dataSet1_transformed.head()

   ID first_name last_name gender
0   1       Todd     Lopez      M
1   2     Joshua     White      M
2   3       Mary     Lewis      F
3   4      Emily     Burns      F
4   5  Christina    Romero      F

#### Transforming dataSet2 into a DataFrame

In [7]:
# Create a filtered dataframe from specific columns
dataSet2_cols = ['ID','User ID','Marital Status','Occupation', 'Annual Income']
dataSet2_transformed = dataSet2_df[dataSet2_cols].copy()

# Rename the column headers
dataSet2_transformed = dataSet2_transformed.rename(columns={
                                                            "User ID": "user_id",
                                                          "Marital Status": "marital_s",
                                                          "Occupation": "occupation",
                                                           "Annual Income": "annual_income"
                                                           })

# Clean the data by dropping duplicates and setting the index
# dataSet1_transformed.drop_duplicates("id", inplace=True)
# dataSet1_transformed.set_index("id", inplace=True)

dataSet2_transformed.head()

   ID  user_id marital_s occupation  annual_income
0   1        1   married    student         251061
1   2        2    single   employed         217323
2   3        3  divorced   employed         211496
3   4        4   married   employed          77843
4   5        5   married        NaN              0

## 3- Loading DataFrames into Database

#### Connecting to local database

In [8]:
connection_string = "root:YourPassword!@localhost/dataSet_db"
engine = create_engine(f'mysql://{connection_string}')

#### Checking for tables

In [9]:
engine.table_names()

['dataSet1', 'dataSet2']

#### Using pandas to load converted DataFrames into database

In [10]:
dataSet1_transformed.to_sql(name='dataSet1', con=engine, if_exists='append', index=False)

In [11]:
dataSet2_transformed.to_sql(name='dataSet2', con=engine, if_exists='append', index=False)

#### Confirming data has been added by querying dataSet1 table
* NOTE: can also check using pgAdmin

In [12]:
pd.read_sql_query('select * from dataSet1', con=engine).head()

   ID first_name last_name gender
0   1       Todd     Lopez      M
1   2     Joshua     White      M
2   3       Mary     Lewis      F
3   4      Emily     Burns      F
4   5  Christina    Romero      F

#### Confirming data has been added by querying dataSet2 table

In [13]:
pd.read_sql_query('select * from dataSet2', con=engine).head()

   ID  user_id marital_s occupation  annual_income
0   1        1   married    student         251061
1   2        2    single   employed         217323
2   3        3  divorced   employed         211496
3   4        4   married   employed          77843
4   5        5   married       None              0